Revit 2024 API
DuctInsulation Class
 Represents insulation applied to the outside of a given duct , fitting or accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class DuctInsulation : InsulationLiningBase
Visual Basic
Public Class DuctInsulation _
	Inherits InsulationLiningBase
Visual C++
public ref class DuctInsulation : public InsulationLiningBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Mechanical.DuctInsulation
See Also
DuctInsulation Members
Autodesk.Revit.DB.Mechanical Namespace